STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Central/STM32_WPAN/App/app_ble.c
          }

          Menu_SetConnectingPage(p_enhanced_conn_complete->Connection_Handle);

          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          UNUSED(p_conn_complete);
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
          uint16_t conn_interval_us = 0;
          uint8_t type, a_address[6];
          conn_interval_us = p_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n",
                       p_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_conn_complete->Peer_Address[5],
                      p_conn_complete->Peer_Address[4],
                      p_conn_complete->Peer_Address[3],
                      p_conn_complete->Peer_Address[2],
                      p_conn_complete->Peer_Address[1],
                      p_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_conn_complete->Conn_Latency,
                      p_conn_complete->Supervision_Timeout * 10
                     );
          UNUSED(conn_interval_us);
          if (aci_gap_check_bonded_device(p_conn_complete->Peer_Address_Type,
                                          &p_conn_complete->Peer_Address[0],
                                          &type,
                                          a_address ) == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP(">>== device is already bonded\n");
          }
          else
          {
            LOG_INFO_APP(">>== device is not bonded\n");
          }
          if (p_conn_complete->Status == 0)
          {
            TMAPAPP_AclConnected(p_conn_complete->Connection_Handle,
                                p_conn_complete->Peer_Address_Type,
                                p_conn_complete->Peer_Address,
                                p_conn_complete->Role);

          }

          Menu_SetConnectingPage(p_conn_complete->Connection_Handle);

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */
        case HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE:
        {
            hci_le_cis_established_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              TMAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
            }
        }
        break;

        case HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE:
        {
            hci_le_cis_established_v2_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_v2_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              TMAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
            }
        }
        break;

        case HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE:
        {
          hci_le_remote_connection_parameter_request_event_rp0 *req_event = (hci_le_remote_connection_parameter_request_event_rp0 *)p_meta_evt->data;
          hci_le_remote_connection_parameter_request_reply(req_event->Connection_Handle,
                                                         req_event->Interval_Min,
                                                         req_event->Interval_Max,
                                                         req_event->Max_Latency,
                                                         req_event->Timeout,
                                                         0,
                                                         0);
          break; /* HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE */
        }

        case HCI_LE_EXTENDED_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          uint8_t i;
          uint8_t audio_device = 0;
          uint8_t* name_ptr = 0;
          uint8_t name_len = 0;


          hci_le_extended_advertising_report_event_rp0 *report = (hci_le_extended_advertising_report_event_rp0*) p_meta_evt->data;

          for (i = 0; i < report->Num_Reports; i++)
          {
            uint16_t parse_index = 0;
            while (parse_index + 3 < report->Data_Length)
            {
              if (report->Data[parse_index + 1] == AD_TYPE_SERVICE_DATA
                  && report->Data[parse_index + 2] == 0x4E
                    && report->Data[parse_index + 3] == 0x18)
              {
                audio_device = 1u;
              }
              if ((report->Data[parse_index + 1] == AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST)\
                 || (report->Data[parse_index + 1] == AD_TYPE_16_BIT_SERV_UUID))
              {
                  for (uint16_t j = 0; j< (report->Data[parse_index] - 1);j++)
                  {
                    if ((report->Data[parse_index + 2 + j ] == 0x4E)
                      && (report->Data[parse_index + 3 + j] == 0x18))
                    {
                      audio_device = 1u;
                    }
                    j+=1;
                  }
              }
              if (report->Data[parse_index + 1] == AD_TYPE_COMPLETE_LOCAL_NAME)
              {
                name_ptr = &report->Data[parse_index + 2];
                name_len = report->Data[parse_index] - 1;
              }
              parse_index += report->Data[parse_index] + 1;
            }
          }

          if (audio_device == 1u)
          {
            char name[30] = "Unknown";
            if (name_ptr != 0)
            {
              UTIL_MEM_cpy_8(&name[0], name_ptr, name_len);
              name[name_len] = '\0';
            }

#if (CFG_TEST_VALIDATION == 1u)
            if (memcmp(&name[0], "TMAP_WBA", 8u) != 0)
              return SVCCTL_UserEvtFlowEnable;
#endif /*(CFG_TEST_VALIDATION == 1u)*/

